
#language: ru

#report.epic=ДымовыеТесты
#report.feature=Документы

@tree

Функциональность: Дымовые тесты

Контекст:
	Дано я подключаю TestClient "ПолныеПрава" логин "iRobot" пароль ""


Сценарий: Открытие формы списка "кс_АктОбИзменении" 

	Дано Я открываю основную форму списка документа "кс_АктОбИзменении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_АктОбИзменении"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_АктОбИзменении"

	Дано Я открываю основную форму документа "кс_АктОбИзменении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_АктОбИзменении"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_АктОПриемкеВыполненныхРабот" 

	Дано Я открываю основную форму списка документа "кс_АктОПриемкеВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_АктОПриемкеВыполненныхРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_АктОПриемкеВыполненныхРабот"

	Дано Я открываю основную форму документа "кс_АктОПриемкеВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_АктОПриемкеВыполненныхРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_КорректировкаЗатратОперативногоУчета" 

	Дано Я открываю основную форму списка документа "кс_КорректировкаЗатратОперативногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_КорректировкаЗатратОперативногоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_КорректировкаЗатратОперативногоУчета"

	Дано Я открываю основную форму документа "кс_КорректировкаЗатратОперативногоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_КорректировкаЗатратОперативногоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_НазначениеИсполнителейНаРаботы" 

	Дано Я открываю основную форму списка документа "кс_НазначениеИсполнителейНаРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_НазначениеИсполнителейНаРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_НазначениеИсполнителейНаРаботы"

	Дано Я открываю основную форму документа "кс_НазначениеИсполнителейНаРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_НазначениеИсполнителейНаРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_ОперативноеПланированиеРабот" 

	Дано Я открываю основную форму списка документа "кс_ОперативноеПланированиеРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ОперативноеПланированиеРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_ОперативноеПланированиеРабот"

	Дано Я открываю основную форму документа "кс_ОперативноеПланированиеРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ОперативноеПланированиеРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_ПеремещениеМатериалов" 

	Дано Я открываю основную форму списка документа "кс_ПеремещениеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПеремещениеМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_ПеремещениеМатериалов"

	Дано Я открываю основную форму документа "кс_ПеремещениеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПеремещениеМатериалов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_ПереоценкаРесурсовВерсии" 

	Дано Я открываю основную форму списка документа "кс_ПереоценкаРесурсовВерсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПереоценкаРесурсовВерсии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_ПереоценкаРесурсовВерсии"

	Дано Я открываю основную форму документа "кс_ПереоценкаРесурсовВерсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПереоценкаРесурсовВерсии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_ПланПотребностейВМатериалах" 

	Дано Я открываю основную форму списка документа "кс_ПланПотребностейВМатериалах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПланПотребностейВМатериалах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_ПланПотребностейВМатериалах"

	Дано Я открываю основную форму документа "кс_ПланПотребностейВМатериалах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПланПотребностейВМатериалах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_ПланПотребностейВРесурсах" 

	Дано Я открываю основную форму списка документа "кс_ПланПотребностейВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПланПотребностейВРесурсах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_ПланПотребностейВРесурсах"

	Дано Я открываю основную форму документа "кс_ПланПотребностейВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПланПотребностейВРесурсах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_ПоступлениеМатериалов" 

	Дано Я открываю основную форму списка документа "кс_ПоступлениеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПоступлениеМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_ПоступлениеМатериалов"

	Дано Я открываю основную форму документа "кс_ПоступлениеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_ПоступлениеМатериалов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_РаспределительнаяВедомость" 

	Дано Я открываю основную форму списка документа "кс_РаспределительнаяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РаспределительнаяВедомость"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_РаспределительнаяВедомость"

	Дано Я открываю основную форму документа "кс_РаспределительнаяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РаспределительнаяВедомость"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_РасходМатериалов" 

	Дано Я открываю основную форму списка документа "кс_РасходМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РасходМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_РасходМатериалов"

	Дано Я открываю основную форму документа "кс_РасходМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РасходМатериалов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_РасценкаБюджетаПроекта" 

	Дано Я открываю основную форму списка документа "кс_РасценкаБюджетаПроекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РасценкаБюджетаПроекта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_РасценкаБюджетаПроекта"

	Дано Я открываю основную форму документа "кс_РасценкаБюджетаПроекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РасценкаБюджетаПроекта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_РеализацияСтроительныхРабот" 

	Дано Я открываю основную форму списка документа "кс_РеализацияСтроительныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РеализацияСтроительныхРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_РеализацияСтроительныхРабот"

	Дано Я открываю основную форму документа "кс_РеализацияСтроительныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РеализацияСтроительныхРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_РеализацияСтроительныхРаботВнутренняя" 

	Дано Я открываю основную форму списка документа "кс_РеализацияСтроительныхРаботВнутренняя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РеализацияСтроительныхРаботВнутренняя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_РеализацияСтроительныхРаботВнутренняя"

	Дано Я открываю основную форму документа "кс_РеализацияСтроительныхРаботВнутренняя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_РеализацияСтроительныхРаботВнутренняя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_СметныйРасчетСтоимости" 

	Дано Я открываю основную форму списка документа "кс_СметныйРасчетСтоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_СметныйРасчетСтоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_СметныйРасчетСтоимости"

	Дано Я открываю основную форму документа "кс_СметныйРасчетСтоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_СметныйРасчетСтоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_СправкаОВыполненныхРаботах" 

	Дано Я открываю основную форму списка документа "кс_СправкаОВыполненныхРаботах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_СправкаОВыполненныхРаботах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_СправкаОВыполненныхРаботах"

	Дано Я открываю основную форму документа "кс_СправкаОВыполненныхРаботах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_СправкаОВыполненныхРаботах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_УГПР" 

	Дано Я открываю основную форму списка документа "кс_УГПР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УГПР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_УГПР"

	Дано Я открываю основную форму документа "кс_УГПР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УГПР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_УсловияПоДоговоруСЗаказчиком" 

	Дано Я открываю основную форму списка документа "кс_УсловияПоДоговоруСЗаказчиком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УсловияПоДоговоруСЗаказчиком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_УсловияПоДоговоруСЗаказчиком"

	Дано Я открываю основную форму документа "кс_УсловияПоДоговоруСЗаказчиком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УсловияПоДоговоруСЗаказчиком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_УсловияПоДоговоруСПодрядчиком" 

	Дано Я открываю основную форму списка документа "кс_УсловияПоДоговоруСПодрядчиком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УсловияПоДоговоруСПодрядчиком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_УсловияПоДоговоруСПодрядчиком"

	Дано Я открываю основную форму документа "кс_УсловияПоДоговоруСПодрядчиком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УсловияПоДоговоруСПодрядчиком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_УчетВыполненныхОбъемовРабот" 

	Дано Я открываю основную форму списка документа "кс_УчетВыполненныхОбъемовРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УчетВыполненныхОбъемовРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_УчетВыполненныхОбъемовРабот"

	Дано Я открываю основную форму документа "кс_УчетВыполненныхОбъемовРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УчетВыполненныхОбъемовРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_УчетРаботыСотрудниковИТехники" 

	Дано Я открываю основную форму списка документа "кс_УчетРаботыСотрудниковИТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УчетРаботыСотрудниковИТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_УчетРаботыСотрудниковИТехники"

	Дано Я открываю основную форму документа "кс_УчетРаботыСотрудниковИТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УчетРаботыСотрудниковИТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "кс_УчетФактическихНакладныхРасходов" 

	Дано Я открываю основную форму списка документа "кс_УчетФактическихНакладныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УчетФактическихНакладныхРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "кс_УчетФактическихНакладныхРасходов"

	Дано Я открываю основную форму документа "кс_УчетФактическихНакладныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа кс_УчетФактическихНакладныхРасходов"
	И Я закрываю текущее окно


