#language: ru

#report.epic=ДымовыеТесты
#report.feature=Документы

@tree

Функциональность: Дымовые тесты типовые документы с доработками

Контекст:
	Дано я подключаю TestClient "ПолныеПрава" логин "iRobot" пароль "Kamala$oft"


Сценарий: Открытие формы списка "АвансовыйОтчет" 

	Дано Я открываю основную форму списка документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйОтчет"

	Дано Я открываю основную форму документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаимозачетЗадолженности" 

	Дано Я открываю основную форму списка документа "ВзаимозачетЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВзаимозачетЗадолженности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаимозачетЗадолженности"

	Дано Я открываю основную форму документа "ВзаимозачетЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВзаимозачетЗадолженности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыпускПродукции" 

	Дано Я открываю основную форму списка документа "ВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыпускПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыпускПродукции"

	Дано Я открываю основную форму документа "ВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыпускПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказКлиента" 

	Дано Я открываю основную форму списка документа "ЗаказКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказКлиента"

	Дано Я открываю основную форму документа "ЗаказКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаВнутреннееПотребление" 

	Дано Я открываю основную форму списка документа "ЗаказНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаВнутреннееПотребление"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаВнутреннееПотребление"

	Дано Я открываю основную форму документа "ЗаказНаВнутреннееПотребление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаВнутреннееПотребление"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПоставщику" 

	Дано Я открываю основную форму списка документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПоставщику"

	Дано Я открываю основную форму документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаРасходованиеДенежныхСредств" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаРасходованиеДенежныхСредств"

	Дано Я открываю основную форму документа "ЗаявкаНаРасходованиеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаРасходованиеДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Командировка" 

	Дано Я открываю основную форму списка документа "Командировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Командировка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Командировка"

	Дано Я открываю основную форму документа "Командировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Командировка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРегистров" 

	Дано Я открываю основную форму списка документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРегистров"

	Дано Я открываю основную форму документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НалоговаяНакладная" 

	Дано Я открываю основную форму списка документа "НалоговаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НалоговаяНакладная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НалоговаяНакладная"

	Дано Я открываю основную форму документа "НалоговаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НалоговаяНакладная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияБух" 

	Дано Я открываю основную форму списка документа "ОперацияБух"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияБух"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияБух"

	Дано Я открываю основную форму документа "ОперацияБух"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияБух"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОприходованиеИзлишковТоваров" 

	Дано Я открываю основную форму списка документа "ОприходованиеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОприходованиеИзлишковТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОприходованиеИзлишковТоваров"

	Дано Я открываю основную форму документа "ОприходованиеИзлишковТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОприходованиеИзлишковТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеОС" 

	Дано Я открываю основную форму списка документа "ПеремещениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеОС"

	Дано Я открываю основную форму документа "ПеремещениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеТоваров" 

	Дано Я открываю основную форму списка документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеТоваров"

	Дано Я открываю основную форму документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеТоваровУслуг" 

	Дано Я открываю основную форму списка документа "ПоступлениеТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеТоваровУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеТоваровУслуг"

	Дано Я открываю основную форму документа "ПоступлениеТоваровУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеТоваровУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеУслугПрочихАктивов" 

	Дано Я открываю основную форму списка документа "ПоступлениеУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеУслугПрочихАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеУслугПрочихАктивов"

	Дано Я открываю основную форму документа "ПоступлениеУслугПрочихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеУслугПрочихАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботу" 

	Дано Я открываю основную форму списка документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботу"

	Дано Я открываю основную форму документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботуСписком" 

	Дано Я открываю основную форму списка документа "ПриемНаРаботуСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботуСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботуСписком"

	Дано Я открываю основную форму документа "ПриемНаРаботуСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботуСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Приложение2КНалоговойНакладной" 

	Дано Я открываю основную форму списка документа "Приложение2КНалоговойНакладной"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Приложение2КНалоговойНакладной"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Приложение2КНалоговойНакладной"

	Дано Я открываю основную форму документа "Приложение2КНалоговойНакладной"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Приложение2КНалоговойНакладной"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуОС" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуОС"

	Дано Я открываю основную форму документа "ПринятиеКУчетуОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходныйКассовыйОрдер" 

	Дано Я открываю основную форму списка документа "ПриходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйКассовыйОрдер"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходныйКассовыйОрдер"

	Дано Я открываю основную форму документа "ПриходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйКассовыйОрдер"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеДоходыРасходы" 

	Дано Я открываю основную форму списка документа "ПрочиеДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочиеДоходыРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеДоходыРасходы"

	Дано Я открываю основную форму документа "ПрочиеДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочиеДоходыРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходныйКассовыйОрдер" 

	Дано Я открываю основную форму списка документа "РасходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйКассовыйОрдер"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходныйКассовыйОрдер"

	Дано Я открываю основную форму документа "РасходныйКассовыйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйКассовыйОрдер"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеОС" 

	Дано Я открываю основную форму списка документа "СписаниеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеОС"

	Дано Я открываю основную форму документа "СписаниеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС"
	И Я закрываю текущее окно

